<!-- dflook/terraform-github-actions {"workspace":"github_pr_comment_refactor-2","backend":"ef702e947a6460ac976eb0916691d7c4fdbfe0966f7c9f5d0803f61d737e5634","backend_type":"remote"} -->
Terraform plan in __tests/workflows/test-cloud/0.13__ in the __github_pr_comment_refactor-2__ workspace
With var files: `tests/workflows/test-cloud/0.13/my_variable.tfvars
`
With variables: `from_variables="from_variables"`
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy.</summary>

```hcl
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # random_id.the_id will be created
  + resource "random_id" "the_id" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 5
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Test Terraform cloud #4](https://github.com/dflook/terraform-github-actions/actions/runs/2254914625)